test_result/fio-3.28-4R5J0001-sr-1G-qd256-num1-16K-3000-WT.txt
fio-3.28-4R5J0001-read-1G-256-1-16K: (g=0): rw=read, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=256
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685863,
  "timestamp_ms" : 1750685863607,
  "time" : "Mon Jun 23 21:37:43 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-read-1G-256-1-16K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-read-1G-256-1-16K",
        "filename" : "/dev/sda",
        "rw" : "read",
        "bs" : "16K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "256",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1056832503,
        "bw" : 1032062,
        "iops" : 64503.937008,
        "runtime" : 1016,
        "total_ios" : 65536,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 2765,
          "max" : 231270,
          "mean" : 7334.299240,
          "stddev" : 3225.654234,
          "N" : 65536
        },
        "clat_ns" : {
          "min" : 1475007,
          "max" : 7886420,
          "mean" : 3953312.257706,
          "stddev" : 206485.635763,
          "N" : 65536,
          "percentile" : {
            "1.000000" : 3817472,
            "5.000000" : 3915776,
            "10.000000" : 3948544,
            "20.000000" : 3948544,
            "30.000000" : 3948544,
            "40.000000" : 3948544,
            "50.000000" : 3948544,
            "60.000000" : 3948544,
            "70.000000" : 3948544,
            "80.000000" : 3948544,
            "90.000000" : 3981312,
            "95.000000" : 3981312,
            "99.000000" : 4079616,
            "99.500000" : 4112384,
            "99.900000" : 6914048,
            "99.950000" : 7307264,
            "99.990000" : 7766016
          },
          "bins" : {
            "1482752" : 2,
            "1499136" : 4,
            "1515520" : 4,
            "1531904" : 5,
            "1548288" : 7,
            "1564672" : 5,
            "1581056" : 4,
            "1597440" : 5,
            "1613824" : 5,
            "1630208" : 8,
            "1646592" : 15,
            "1662976" : 9,
            "1679360" : 6,
            "1695744" : 3,
            "1712128" : 4,
            "1728512" : 5,
            "1744896" : 12,
            "1761280" : 7,
            "1777664" : 3,
            "1794048" : 3,
            "1810432" : 4,
            "1826816" : 4,
            "1843200" : 7,
            "1859584" : 14,
            "1875968" : 5,
            "1892352" : 6,
            "1908736" : 4,
            "1925120" : 2,
            "1941504" : 4,
            "1957888" : 7,
            "1974272" : 12,
            "1990656" : 4,
            "2007040" : 3,
            "2023424" : 6,
            "2039808" : 4,
            "2056192" : 4,
            "2072576" : 5,
            "2088960" : 8,
            "2113536" : 8,
            "2146304" : 17,
            "2179072" : 12,
            "2211840" : 12,
            "2244608" : 8,
            "2277376" : 5,
            "2310144" : 8,
            "2342912" : 18,
            "2375680" : 9,
            "2408448" : 1,
            "2473984" : 1,
            "2506752" : 7,
            "2539520" : 7,
            "2572288" : 3,
            "2637824" : 1,
            "2670592" : 9,
            "2703360" : 3,
            "2736128" : 3,
            "2834432" : 1,
            "2867200" : 11,
            "2899968" : 2,
            "2932736" : 2,
            "2998272" : 8,
            "3096576" : 8,
            "3194880" : 10,
            "3227648" : 3,
            "3260416" : 2,
            "3293184" : 1,
            "3325952" : 8,
            "3358720" : 2,
            "3457024" : 6,
            "3489792" : 6,
            "3588096" : 8,
            "3653632" : 2,
            "3686400" : 1,
            "3719168" : 14,
            "3751936" : 41,
            "3784704" : 46,
            "3817472" : 337,
            "3850240" : 699,
            "3883008" : 968,
            "3915776" : 1947,
            "3948544" : 51827,
            "3981312" : 6187,
            "4014080" : 1113,
            "4046848" : 1012,
            "4079616" : 504,
            "4112384" : 144,
            "4145152" : 20,
            "4177920" : 5,
            "4227072" : 5,
            "4292608" : 5,
            "4358144" : 4,
            "4423680" : 4,
            "4489216" : 4,
            "4554752" : 4,
            "4620288" : 4,
            "4685824" : 4,
            "4751360" : 5,
            "4816896" : 4,
            "4882432" : 5,
            "4947968" : 4,
            "5013504" : 4,
            "5079040" : 4,
            "5144576" : 4,
            "5210112" : 6,
            "5275648" : 4,
            "5341184" : 7,
            "5406720" : 1,
            "5472256" : 4,
            "5537792" : 6,
            "5603328" : 6,
            "5734400" : 4,
            "5799936" : 4,
            "5865472" : 5,
            "5931008" : 5,
            "5996544" : 4,
            "6062080" : 8,
            "6127616" : 2,
            "6193152" : 2,
            "6258688" : 4,
            "6324224" : 4,
            "6389760" : 5,
            "6455296" : 3,
            "6520832" : 5,
            "6586368" : 5,
            "6651904" : 4,
            "6717440" : 4,
            "6782976" : 4,
            "6848512" : 4,
            "6914048" : 4,
            "6979584" : 4,
            "7045120" : 6,
            "7110656" : 7,
            "7176192" : 3,
            "7241728" : 2,
            "7307264" : 8,
            "7372800" : 2,
            "7438336" : 2,
            "7503872" : 6,
            "7569408" : 7,
            "7634944" : 1,
            "7700480" : 4,
            "7766016" : 4,
            "7831552" : 4,
            "7897088" : 2
          }
        },
        "lat_ns" : {
          "min" : 1484298,
          "max" : 7894431,
          "mean" : 3960843.619369,
          "stddev" : 206421.566736,
          "N" : 65536
        },
        "bw_min" : 1033728,
        "bw_max" : 1034208,
        "bw_agg" : 100.000000,
        "bw_mean" : 1033968.000000,
        "bw_dev" : 339.411255,
        "bw_samples" : 2,
        "iops_min" : 64608,
        "iops_max" : 64638,
        "iops_mean" : 64623.000000,
        "iops_stddev" : 21.213203,
        "iops_samples" : 2
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1015,
      "usr_cpu" : 12.118227,
      "sys_cpu" : 55.172414,
      "ctx" : 19867,
      "majf" : 0,
      "minf" : 1036,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.903870
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.998468,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.288391,
        "4" : 95.217896,
        "10" : 4.493713,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 256,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 57001,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 223716,
      "write_ticks" : 0,
      "in_queue" : 223716,
      "util" : 90.243902
    }
  ]
}

fio-3.28-4R5J0001-read-1G-256-1-16K: (groupid=0, jobs=1): err= 0: pid=82690: Mon Jun 23 21:37:43 2025
  read: IOPS=64.5k, BW=1008MiB/s (1057MB/s)(1024MiB/1016msec)
    slat (usec): min=2, max=231, avg= 7.33, stdev= 3.23
    clat (usec): min=1475, max=7886, avg=3953.31, stdev=206.49
     lat (usec): min=1484, max=7894, avg=3960.84, stdev=206.42
    clat percentiles (usec):
     |  1.00th=[ 3818],  5.00th=[ 3916], 10.00th=[ 3949], 20.00th=[ 3949],
     | 30.00th=[ 3949], 40.00th=[ 3949], 50.00th=[ 3949], 60.00th=[ 3949],
     | 70.00th=[ 3949], 80.00th=[ 3949], 90.00th=[ 3982], 95.00th=[ 3982],
     | 99.00th=[ 4080], 99.50th=[ 4113], 99.90th=[ 6915], 99.95th=[ 7308],
     | 99.99th=[ 7767]
   bw (  KiB/s): min=1033728, max=1034208, per=100.00%, avg=1033968.00, stdev=339.41, samples=2
   iops        : min=64608, max=64638, avg=64623.00, stdev=21.21, samples=2
  lat (msec)   : 2=0.29%, 4=95.22%, 10=4.49%
  cpu          : usr=12.12%, sys=55.17%, ctx=19867, majf=0, minf=1036
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=1008MiB/s (1057MB/s), 1008MiB/s-1008MiB/s (1057MB/s-1057MB/s), io=1024MiB (1074MB), run=1016-1016msec

Disk stats (read/write):
  sda: ios=57001/0, merge=0/0, ticks=223716/0, in_queue=223716, util=90.24%